jekyll/_posts/2019-08-22-why-knots.html
---
layout: wide
title: Why Knots?
categories: misc
---

<div id="outline-container-org76b32b0" class="outline-2">
<h2 id="org76b32b0">Why Knots?</h2>
<div class="outline-text-2" id="text-org76b32b0">
<p>
(lightly edited from direct messages to <a href="https://twitter.com/cognazor">Jason Snyder</a> 8/6/2019)
</p>
</div>

<div id="outline-container-org8ee917e" class="outline-3">
<h3 id="org8ee917e">The perfect knot:</h3>
<div class="outline-text-3" id="text-org8ee917e">
<ul class="org-ul">
<li>exists for a purpose</li>
<li>accounts for the materials in which it is tied</li>
<li>unties exactly when its usefulness expires</li>
<li>binds two ropes together as robustly as if they were one, or binds a rope to a fixed point without compromising the strength of the rope</li>
<li>either passes through a block without snagging or will <i>not</i> pass through a block, depending on the knot</li>
</ul>
</div>
</div>

<div id="outline-container-orgba9c3b1" class="outline-3">
<h3 id="orgba9c3b1">The imperfect knot:</h3>
<div class="outline-text-3" id="text-orgba9c3b1">
<ul class="org-ul">
<li>forms without intention</li>
<li>pays no heed to the particulars of its material</li>
<li>is difficult or impossible to undo</li>
<li>cannot be counted upon in its security</li>
<li>reduces the strength of the rope in which it is tied</li>
<li>will snarl in the block</li>
</ul>

<p>
The knot becomes an exacting metaphor for a way of holding emotions/concepts/attachments/reality in general:
</p>

<p>
firmly, 
</p>

<p>
with an eye for the particular, 
</p>

<p>
until the exact moment they are no longer useful, 
</p>

<p>
in a way that slides when necessary and grips when it is not.
</p>

<p>
So, the transmutation of a clot or snarl into a thoughtful knot (knotted cord also having some previous sacred associations) is a total transformation into an impermanent but useful affordance in the thread of life, that can be gripped, clipped in to, undone in a moment, used to take up slack, used to produce slack, whatever else our life may need help in its arising.
</p>

<p>
Still, it implies some skill in the transformation, since the imperfect knot looks an awful lot like a clot or snarl&#x2026;
</p>
</div>
</div>
</div>
